import React, {useState} from "react"
import Navbars from "./Navbars";
import {Link} from "react-router-dom";
import TwoCaruosel from "./TwoCaruosel";

function Lefts() {


    return (
        <div className="container">
            <div className="row">
                <Navbars/>
                <div className="col-11">
                    <div className=" d-flex justify-content-between">
                        <div className="new">Новости компании</div>
                        <div className="come">
                            <div className="me">Новое</div>

                            <div className="the">Популярное</div>
                        </div>
                    </div>
                    <div className="object">
                        <div className="das">

                            <div className="dail d-flex justify-content-around">
                                <div className="see">23.03.2022</div>
                                <div className="jac  d-flex justify-content-around">
                                    <div className="seen">
                                        Конференция
                                    </div>
                                    <div className="quit">Веб разработка</div>
                                    <div className="lort"> HTML</div>
                                    <div className="sir">CSS</div>
                                    <div className="jav"> JavaScript</div>
                                </div>

                                <button className="feil">
                                    Поделится
                                    <img src="./images/icons.png" alt=""/>
                                </button>
                            </div>
                            <div className="askid">
                                Приглашаем на открытый урок который состоится
                            </div>
                            <img className="tenses" src="./images/male1.png" alt=""/>
                            <img className="useful" src="./images/logo2.png" alt=""/>
                            <Link  to="/Stajrovka">
                                <button className="learn">Открытый урок</button>
                            </Link>
                            <div className="coffe">
                                С целью воспитания и уважения к культуре и традициям своего народа, родному
                                языку в 8Г классе прошел открытый урок – конференция на тему «Язык и культура моего
                                края».
                                В ходе урока ребята ближе познакомились с историей, культурой, традициями русского,
                                мордовского
                                и татарского языков.С целью воспитания и уважения к культуре и традициям своего народа,
                                родному языку
                                в 8Г классе прошел открытый урок – конференция на тему «Язык и культура моего края». В
                                ходе урока ребята ближе
                                познакомились с историей, культурой, традициями русского, мордовского и татарского
                                языков.С целью воспитания и
                                уважения к культуре и традициям своего народа, родному языку в 8Г классе прошел открытый
                                урок – конференция на
                                тему «Язык и культура моего края». В ходе урока ребята ближе познакомились с историей,
                                культурой, традициями
                                русского, мордовского и татарского языков.С целью воспитания и уважения к культуре и
                                традициям своего народа,
                                родному языку в 8Г классе прошел открытый урок – конференция на тему «Язык и культура
                                моего края». В ходе урока
                                ребята ближе познакомились с историей, культурой, традициями русского, мордовского и
                                татарского языков.С целью
                                воспитания и уважения к культуре и
                                традициям своего народа, родному языку в 8Г классе прошел открытый урок – конференция на
                                тему
                            </div>
                            <div className="d-flex justify-content-between mt-5">
                                <div className="days">
                                    <img className="w-100 h-100" src="./images/beauti.png" alt=""/>
                                </div>
                                <div className="day">
                                    <img className="w-100 h-100" src="./images/beauti.png" alt=""/>
                                </div>
                            </div>
                            <div className="bay">
                                «Язык и культура моего края». В ходе урока ребята ближе познакомились с историей,
                                культурой, традициями русского, мордовского и татарского языков.С целью воспитания и
                                уважения к культуре и традициям своего народа, родному языку в 8Г классе прошел открытый
                                урок – конференция на тему «Язык и культура моего края». В ходе урока ребята ближе
                                познакомились с историей, культурой, традициями русского, мордовского и татарского
                                языков.С целью воспитания и уважения к культуре и традициям своего народа, родному языку
                                в 8Г классе прошел открытый урок – конференция на тему «Язык и культура моего края». В
                                ходе урока ребята ближе познакомились с историей, культурой, традициями зыков.С целью
                                воспитания и уважения к культуре и традициям своего народа, родному языку в 8Г классе
                                прошел открытый урок – конференция на тему «Язык и культура моего края». В ходе урока
                                ребята ближе познакомились с историей, культурой, традициями русского, мордовского и
                                татарского языков.С целью воспитания и уважения к культуре и традициям своего народа,
                                родному языку в 8Г классе прошел открытый урок – конференция на тему «Язык и культура
                                моего края». В ходе урока ребята ближе познакомились с историей, культурой, традициями
                                русского, мордовского и татарского языков.
                                Весовые: лёгкие, воздушные, невесомые ― светлые оттенки, тяжёлые ― тёмные оттенки.
                                Температурные: красный всем кажется горячим, а синий — холодным.
                                Акустические (слуховые): красный также ассоциируется с громкостью, голубой — с тишиной.
                                Пространственные: тёплые оттенки человек воспринимает ближе к себе, холодные —
                                подчёркивают дистанцию.
                                Возрастные: дети и молодёжь — яркие цвета, пожилые — мягкие, приглушённые оттенки.
                                Сезонные: цвета напоминают про времена года; тёплые оттенки — воспоминания о лете,
                                холодные — о зиме.
                                Культурные: ассоциации с колоритом объектов культуры.
                            </div>
                            <button className="fel">
                                Поделится
                                <img src="./images/icons1.png" alt=""/>
                            </button>
                        </div>
                    </div>
                    <div className="told">Читайте так же</div>
                    <div className="d-flex justify-content-between mt-5">
                        <div className="six">
                            <img className="sao w-100" src="./images/male.png" alt=""/>
                            <img className="difrent" src="./images/logo 3.png" alt=""/>
                            <button className="dad">Открытый урок</button>
                            <div className="son">23.03.2022</div>
                            <div className="title">Приглашаем на открытый урок который состоится</div>
                            <div className="oil">
                                Анонс новости небольшое описание читай не читай а лучше почитай.
                                Анонс новости небольшое описание читай не читай а лучше почитай.
                            </div>
                        </div>
                        <div className="seven">
                            <img className="sao w-100" src="./images/male.png" alt=""/>
                            <img className="difrent" src="./images/logo 3.png" alt=""/>
                            <button className="dad">Открытый урок</button>
                             <div className="son">23.03.2022</div>
                            <div className="title">Приглашаем на открытый урок который состоится</div>
                            <div className="oil">
                                Анонс новости небольшое описание читай не читай а лучше почитай.
                                Анонс новости небольшое описание читай не читай а лучше почитай.
                            </div>
                        </div>
                        <div className="eit">
                            <img className="sao w-100" src="./images/male.png" alt=""/>
                            <img className="difrent" src="./images/logo 3.png" alt=""/>
                            <button className="dad">Открытый урок</button>
                             <div className="son">23.03.2022</div>
                            <div className="title">Приглашаем на открытый урок который состоится</div>
                            <div className="oil">
                                Анонс новости небольшое описание читай не читай а лучше почитай.
                                Анонс новости небольшое описание читай не читай а лучше почитай.
                            </div>

                        </div>
                    </div>
                    <TwoCaruosel/>
                </div>
            </div>

        </div>
    )

}

export default Lefts
